Revit 2027 API
BuiltInFailures.CutFailures.CannotCutInstanceOutGenWarn Property
 Can't cut instance(s) of [Symbol] out of its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutInstanceOutGenWarn { get; }
Public Shared ReadOnly Property CannotCutInstanceOutGenWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutInstanceOutGenWarn {
	FailureDefinitionId^ get ();
}
static member CannotCutInstanceOutGenWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace